_Rarzrabotki/Kazna/Documents/БюджетМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>БюджетМесяц</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛимитыНаМесяц</xr:Item>
				<xr:Item>AccumulationRegister.БюджетыНаМесяц</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВерсии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыВерсийБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.БюджетМесяц</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиБюджетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиБДДС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоказательБюджета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаправлениеДДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/БюджетыНаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>БюджетыНаМесяц</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиБюджетов</v8:Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДДС</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОплаты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПериода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПериодовБюджетирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/AccumulationRegisters/ЛимитыНаМесяц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыНаМесяц</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Месяц</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПоказательБюджета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыВерсийБюджетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыВерсийБюджетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыПериодовБюджетирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыПериодовБюджетирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Documents/БюджетМесяц/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный= Пользователи.ТекущийПользователь();
	
	ВидВерсии= Перечисления.ВидыВерсийБюджетов.Первичный;
	ВидПериода=Перечисления.ВидыПериодовБюджетирования.Неделя;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.БюджетыНаМесяц.Записывать = Истина;
	
	Для Каждого Строка Из Показатели Цикл
		Движение	= Движения.БюджетыНаМесяц.Добавить();
		Движение.Регистратор		= Ссылка;
		Движение.Период				= Дата;
		Движение.Подразделение		= Подразделение;//Строка.Подразделение;
		Движение.ПоказательБюджета	= Строка.ПоказательБюджета;
		Движение.Месяц				= НачалоМесяца(Месяц);
		Движение.НаправлениеДДС		= Строка.НаправлениеДДС;
		Движение.Сумма				= Строка.Сумма;
		Движение.Направление=Направление;
	КонецЦикла;
	
	
	Для Каждого Строка Из ПоказателиБДДС Цикл
		Движение	= Движения.БюджетыНаМесяц.Добавить();
		Движение.Регистратор		= Ссылка;
		Движение.Период				= Дата;
		Движение.Подразделение		= Подразделение;//Строка.Подразделение;
		Движение.ПоказательБюджета	= Строка.ПоказательБюджета;
		Если ВидПериода= Перечисления.ВидыПериодовБюджетирования.Неделя Тогда
			Движение.Месяц				= НачалоНедели(Месяц);	
		Иначе	
		     Движение.Месяц				= НачалоМесяца(Месяц);
		КонецЕсли;
		//Движение.НаправлениеДДС		= Строка.НаправлениеДДС;
		Движение.ВидОплаты				= Строка.ВидОплаты;
		Движение.Сумма				= Строка.Сумма  ;
		Движение.ВидПериода				= ВидПериода ;
		Если ЗначениеЗаполнено(Направление) Тогда
			Движение.Направление=Направление;
		КонецЕсли;
	КонецЦикла;
	
	Если ВидВерсии=Перечисления.ВидыВерсийБюджетов.Корректировка Тогда
		
		Для Каждого Строка Из ДокументОснование.Показатели Цикл
			Движение	= Движения.БюджетыНаМесяц.Добавить();
			Движение.Регистратор		= Ссылка;
			Движение.Период				= ДокументОснование.Дата;
			Движение.Подразделение		= Подразделение;//Строка.Подразделение;
			Движение.ПоказательБюджета	= Строка.ПоказательБюджета;
			Движение.Месяц				= НачалоМесяца(ДокументОснование.Месяц);
			Движение.НаправлениеДДС		= Строка.НаправлениеДДС;
			Движение.Сумма				= -Строка.Сумма;
			Движение.Направление=Направление;
		КонецЦикла;
		
		Для Каждого Строка Из ДокументОснование.ПоказателиБДДС Цикл
			Движение	= Движения.БюджетыНаМесяц.Добавить();
			Движение.Регистратор		= Ссылка;
			Движение.Период				= ДокументОснование.Дата;
			Движение.Подразделение		= Подразделение;//Строка.Подразделение;
			Движение.ПоказательБюджета	= Строка.ПоказательБюджета;
			Если ВидПериода= Перечисления.ВидыПериодовБюджетирования.Неделя Тогда
				Движение.Месяц				= НачалоНедели(ДокументОснование.Месяц);	
			Иначе	
				Движение.Месяц				= НачалоМесяца(ДокументОснование.Месяц);
			КонецЕсли;
			//Движение.НаправлениеДДС		= Строка.НаправлениеДДС;
			Движение.ВидОплаты				= Строка.ВидОплаты;
			Движение.Сумма				= -Строка.Сумма  ;
			Движение.ВидПериода				= ВидПериода ;
			Движение.Направление=Направление;
		КонецЦикла;
		
		
		
	КонецЕсли;   
	
	//Тютюн   
			Движения.ЛимитыНаМесяц.Записывать = Истина;
		
	Если Лимит Тогда    
		ДЛя Каждого Строка Из ПоказателиБДДС Цикл
			
			Движение           	= Движения.ЛимитыНаМесяц.Добавить(); 
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Регистратор		= Ссылка;
			Движение.Период				= Дата;
			Движение.Месяц				= НачалоМесяца(Дата);
			Движение.Подразделение		= Строка.Подразделение;
			Движение.ПоказательБюджета	= Строка.ПоказательБюджета;
			Движение.Сумма				= Строка.Сумма;
			  
		КонецЦикла;	

		
	КонецЕсли;
	//КонецИзменений
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеОбязательныхРевизитов(Отказ)
	
	МассивПроверяемыхРеквизитов = Новый Массив;
	МассивПроверяемыхРеквизитов.Добавить("Подразделение");
	МассивПроверяемыхРеквизитов.Добавить("Месяц");
	
	АХ_ОбщегоНазначения.КонтрольЗаполненияОбязательныхРеквизитовШапкиОбъекта(ЭтотОбъект, МассивПроверяемыхРеквизитов, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если не ЗначениеЗаполнено(ВидВерсии) Тогда
		ВидВерсии= Перечисления.ВидыВерсийБюджетов.Первичный;
	КонецЕсли;
	
	Если не ЗначениеЗаполнено(ВидПериода) Тогда
		ВидПериода=Перечисления.ВидыПериодовБюджетирования.Неделя;
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование=Документы.БюджетМесяц.ПустаяСсылка();
КонецПроцедуры
